Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC01/atdf/PIC32CK1025GC01100.atdf
        <register name="CTR" offset="0x7C" rw="R" size="4" access-size="4" caption="Cache Type Register">
          <bitfield name="IminLine" caption="Instruction cache minimum line length" mask="0xF"/>
          <bitfield name="DminLine" caption="Data cache minimum line length" mask="0xF0000"/>
          <bitfield name="ERG" caption="Exclusives Reservation Granule" mask="0xF00000"/>
          <bitfield name="CWG" caption="Cache Write-back Granule" mask="0xF000000"/>
          <bitfield name="Format" caption="Cache Type Register format" mask="0xE0000000" values="CTR__Format"/>
        </register>
        <register name="CCSIDR" offset="0x80" rw="R" size="4" access-size="4" caption="Current Cache Size ID register">
          <bitfield name="LineSize" caption="log2(number of words per line) - 2" mask="0x7"/>
          <bitfield name="Associativity" caption="Associativity - 1" mask="0x1FF8"/>
          <bitfield name="NumSets" caption="Number of sets - 1" mask="0xFFFE000"/>
          <bitfield name="WA" caption="Write-Allocate" mask="0x10000000"/>
          <bitfield name="RA" caption="Read-Allocate" mask="0x20000000"/>
          <bitfield name="WB" caption="Write-Back" mask="0x40000000"/>
          <bitfield name="WT" caption="Write-Through" mask="0x80000000"/>
        </register>
        <register name="CSSELR" offset="0x84" rw="RW" size="4" access-size="4" caption="Cache Size Selection Register">
          <bitfield name="InD" caption="Instruction not Data" mask="0x1"/>
          <bitfield name="Level" caption="Cache level - 1" mask="0xE"/>
        </register>
        <register name="CPACR" offset="0x88" rw="RW" size="4" access-size="4" caption="Coprocessor Access Control Register">
          <bitfield name="CP0" caption="Coprocessor 0 privilege" mask="0x3"/>
          <bitfield name="CP1" caption="Coprocessor 1 privilege" mask="0xC"/>
          <bitfield name="CP2" caption="Coprocessor 2 privilege" mask="0x30"/>
          <bitfield name="CP3" caption="Coprocessor 3 privilege" mask="0xC0"/>
          <bitfield name="CP4" caption="Coprocessor 4 privilege" mask="0x300"/>
          <bitfield name="CP5" caption="Coprocessor 5 privilege" mask="0xC00"/>
          <bitfield name="CP6" caption="Coprocessor 6 privilege" mask="0x3000"/>
          <bitfield name="CP7" caption="Coprocessor 7 privilege" mask="0xC000"/>
          <bitfield name="CP10" caption="Floating-point Extension access rights" mask="0x300000"/>
          <bitfield name="CP11" caption="CP11 Privilege" mask="0xC00000"/>
        </register>
        <register name="NSACR" offset="0x8C" rw="RW" size="4" access-size="4" caption="Non-secure Access Control Register">
          <bitfield name="CP0" caption="Coprocessor 0 Non-secure" mask="0x1"/>
          <bitfield name="CP1" caption="Coprocessor 1 Non-secure" mask="0x2"/>
          <bitfield name="CP2" caption="Coprocessor 2 Non-secure" mask="0x4"/>
          <bitfield name="CP3" caption="Coprocessor 3 Non-secure" mask="0x8"/>
          <bitfield name="CP4" caption="Coprocessor 4 Non-secure" mask="0x10"/>
          <bitfield name="CP5" caption="Coprocessor 5 Non-secure" mask="0x20"/>
          <bitfield name="CP6" caption="Coprocessor 6 Non-secure" mask="0x40"/>
          <bitfield name="CP7" caption="Coprocessor 7 Non-secure" mask="0x80"/>
          <bitfield name="CP10" caption="Floating-point Extension Non-secure" mask="0x400"/>
          <bitfield name="CP11" caption="CP11 Non-secure" mask="0x800"/>
        </register>
      </register-group>
      <value-group name="ICSR__PENDSTCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the SysTick exception" value="1"/>
      </value-group>
      <value-group name="ICSR__PENDSTSET">
        <value name="VALUE_0" caption="Write: no effect; read: SysTick exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes SysTick exception state to pending; read: SysTick exception is pending" value="1"/>
      </value-group>
      <value-group name="ICSR__PENDSVCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the PendSV exception" value="1"/>
      </value-group>
      <value-group name="ICSR__PENDSVSET">
        <value name="VALUE_0" caption="Write: no effect; read: PendSV exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes PendSV exception state to pending; read: PendSV exception is pending" value="1"/>
      </value-group>
      <value-group name="ICSR__PENDNMISET">
        <value name="VALUE_0" caption="Write: no effect; read: NMI exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes NMI exception state to pending; read: NMI exception is pending" value="1"/>
      </value-group>
      <value-group name="AIRCR__VECTCLRACTIVE">
        <value name="NO" caption="Do not clear active state" value="0x0"/>
        <value name="YES" caption="Clear active state" value="0x1"/>
      </value-group>
      <value-group name="AIRCR__SYSRESETREQ">
        <value name="NO" caption="Do not request a system reset" value="0"/>
        <value name="YES" caption="Request a system reset" value="1"/>
      </value-group>
      <value-group name="AIRCR__SYSRESETREQS">
        <value name="BOTH" caption="SYSRESETREQ functionality is available to both Security states" value="0x0"/>
        <value name="SECURE" caption="SYSRESETREQ functionality is only available to Secure state" value="0x1"/>
      </value-group>
      <value-group name="AIRCR__BFHFNMINS">
        <value name="SECURE" caption="BusFault, HardFault, and NMI are Secure" value="0x0"/>
        <value name="NON_SECURE" caption="BusFault and NMI are Non-secure and exceptions can target Non-secure HardFault" value="0x1"/>
      </value-group>
      <value-group name="AIRCR__PRIS">
        <value name="SAME" caption="Priority ranges of Secure and Non-secure exceptions are identical" value="0x0"/>
        <value name="NS_DEPRIO" caption="Non-secure exceptions are de-prioritized" value="0x1"/>
      </value-group>
      <value-group name="AIRCR__ENDIANNESS">
        <value name="LITTLE" caption="Little-endian" value="0"/>
        <value name="BIG" caption="Big-endian" value="1"/>
      </value-group>
      <value-group name="SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SCR__SEVONPEND">
        <value name="VALUE_0" caption="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" value="0"/>
        <value name="VALUE_1" caption="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" value="1"/>
      </value-group>
      <value-group name="CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
