Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC01/atdf/PIC32CK1025GC01100.atdf
        <register name="INTFLAG" offset="0x20" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="SPI Interrupt Flag Register">
          <bitfield name="SPIRXBF" caption="SPI Receive Buffer Full Status Bit" mask="0x1"/>
          <bitfield name="SPITXBE" caption="SPI Transmit Buffer Empty Status Bit" mask="0x10"/>
          <bitfield name="FRMERR" caption="SPI Frame Error Status bit" mask="0x8000"/>
          <bitfield name="SPITUR" caption="Transmit Underrun Status bit" mask="0x8000000"/>
          <bitfield name="SPIROV" caption="Receive Overflow Status bit" mask="0x40000000"/>
        </register>
        <register name="STATUS" offset="0x24" rw="R" size="4" initval="0x90002000" caption="SPI Status Register">
          <bitfield name="RXBUFELM" caption="Receive Buffer Element Count bits" mask="0x1FF"/>
          <bitfield name="SRMT" caption="Register (SR) Empty bit" mask="0x2000"/>
          <bitfield name="SPIBUSY" caption="SPI activity status bit" mask="0x4000"/>
          <bitfield name="TXBUFELM" caption="Transmit Buffer Element Count bits" mask="0x1FF0000"/>
          <bitfield name="SPITBF" caption="SPI Transmit Buffer Full Status bit" mask="0x4000000"/>
          <bitfield name="SPITBE" caption="SPI Transmit Buffer Empty status bit" mask="0x10000000"/>
          <bitfield name="SPIRBF" caption="SPI Receive Buffer Full status bit" mask="0x20000000"/>
          <bitfield name="SPIRBE" caption="RX Buffer Empty bit" mask="0x80000000"/>
        </register>
        <register name="BUF" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="SPI Buffer Register">
          <bitfield name="DATA" caption="FIFO Data bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="BRG" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="SPI Baud Rate Register">
          <bitfield name="BRG" caption="Baud Rate Divisor bits" mask="0x1FFF"/>
        </register>
        <register name="DBGCTRL" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="SPI Debug Control Register">
          <bitfield name="DBGRUN" caption="Debug Running State" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x34" rw="R" size="4" initval="0x00000000" caption="SPI Sync Busy Register">
          <bitfield name="SWRSTBSY" caption="Software reset busy bit   --- Synchronizing Busy bit for swrst" mask="0x1"/>
        </register>
        <register name="EVCTRL" offset="0x38" rw="RW" size="4" initval="0x00000000" caption="SPI Event Control Register">
          <bitfield name="FPSEEN" caption="Frame Pulse Event Enable Bit" mask="0x1"/>
        </register>
      </register-group>
      <value-group name="SELCTRL__CLKINDLY">
        <value name="TDLY0" caption="0 Tap Delays" value="0x0"/>
        <value name="TDLY1" caption="1 Tap Delay" value="0x1"/>
        <value name="TDLY2" caption="2 Tap Delay" value="0x2"/>
        <value name="TDLY3" caption="3 Tap Delay" value="0x3"/>
      </value-group>
      <value-group name="SELCTRL__SRXISEL">
        <value name="RXBEMPTY" caption="RXB Empty" value="0x0"/>
        <value name="RXBNEMPTY" caption="RXB Not Empty" value="0x1"/>
        <value name="RXBHFULL" caption="RXB Half Full" value="0x2"/>
        <value name="RXBFULL" caption="RXB Full" value="0x3"/>
      </value-group>
      <value-group name="SELCTRL__STXISEL">
        <value name="TXBSREMPTY" caption="TXB And SR Empty" value="0x0"/>
        <value name="TXBEMPTY" caption="TXB Empty" value="0x1"/>
        <value name="TXBHEMPTY" caption="TXB Half Empty" value="0x2"/>
        <value name="TXBNFULL" caption="TXB Not Full" value="0x3"/>
      </value-group>
      <value-group name="SELCTRL__MODEEN">
        <value name="DFTLEN" caption="Default Mode" value="0x0"/>
        <value name="AUDEN" caption="Audio Mode" value="0x1"/>
        <value name="TDMEN" caption="Framed Mode" value="0x2"/>
        <value name="TPDEN" caption="Broadcast Mode" value="0x3"/>
      </value-group>
      <value-group name="SPICTRL__MODE">
        <value name="MODE8" caption="8 Bits Mode" value="0x0"/>
        <value name="MODE16" caption="16 Bits Mode" value="0x1"/>
        <value name="MODE32" caption="32 Bits Mode" value="0x2"/>
      </value-group>
      <value-group name="FRAMECTRL__FRMSYPW">
        <value name="SYPW0" caption="Frame sync pulse is one clock wide" value="0x0"/>
        <value name="SYPW1" caption="Frame sync pulse is one slots wide" value="0x1"/>
        <value name="SYPW2" caption="Frame sync pulse is two slots wide" value="0x2"/>
        <value name="SYPW3" caption="Frame sync pulse is three slots wide" value="0x3"/>
        <value name="SYPW4" caption="Frame sync pulse is four slots wide" value="0x4"/>
        <value name="SYPW5" caption="Frame sync pulse is five slots wide" value="0x5"/>
        <value name="SYPW6" caption="Frame sync pulse is six slots wide" value="0x6"/>
        <value name="SYPW7" caption="Frame sync pulse is seven slots wide" value="0x7"/>
        <value name="SYPW8" caption="Frame sync pulse is eight slots wide" value="0x8"/>
        <value name="SYPW16" caption="Frame sync pulse is sixteen slots wide" value="0x9"/>
        <value name="SYPW31" caption="Frame sync pulse is thirty one slots wide" value="0xA"/>
      </value-group>
      <value-group name="FRAMECTRL__FRMCNT">
        <value name="CNT1" caption="Generate a Frame sync pulse on each serial word" value="0x0"/>
        <value name="CNT2" caption="Number of slots per frame sync pulse is 2" value="0x1"/>
        <value name="CNT3" caption="Number of slots per frame sync pulse is 3" value="0x2"/>
        <value name="CNT4" caption="Number of slots per frame sync pulse is 4" value="0x3"/>
        <value name="CNT5" caption="Number of slots per frame sync pulse is 5" value="0x4"/>
        <value name="CNT6" caption="Number of slots per frame sync pulse is 6" value="0x5"/>
        <value name="CNT8" caption="Number of slots per frame sync pulse is 8" value="0x6"/>
        <value name="CNT10" caption="Number of slots per frame sync pulse is 10" value="0x7"/>
        <value name="CNT12" caption="Number of slots per frame sync pulse is 12" value="0x8"/>
        <value name="CNT14" caption="Number of slots per frame sync pulse is 14" value="0x9"/>
        <value name="CNT16" caption="Number of slots per frame sync pulse is 16" value="0xA"/>
        <value name="CNT18" caption="Number of slots per frame sync pulse is 18" value="0xB"/>
        <value name="CNT20" caption="Number of slots per frame sync pulse is 20" value="0xC"/>
        <value name="CNT22" caption="Number of slots per frame sync pulse is 22" value="0xD"/>
        <value name="CNT24" caption="Number of slots per frame sync pulse is 24" value="0xE"/>
        <value name="CNT26" caption="Number of slots per frame sync pulse is 26" value="0xF"/>
        <value name="CNT28" caption="Number of slots per frame sync pulse is 28" value="0x10"/>
        <value name="CNT30" caption="Number of slots per frame sync pulse is 30" value="0x11"/>
        <value name="CNT32" caption="Number of slots per frame sync pulse is 32" value="0x12"/>
      </value-group>
      <value-group name="FRAMECTRL__TDMSSZ">
        <value name="SLTSZ8" caption="Slot Size 8" value="0x0"/>
        <value name="SLTSZ12" caption="Slot Size 12" value="0x1"/>
        <value name="SLTSZ16" caption="Slot Size 16" value="0x2"/>
        <value name="SLTSZ20" caption="Slot Size 20" value="0x3"/>
        <value name="SLTSZ24" caption="Slot Size 24" value="0x4"/>
        <value name="SLTSZ28" caption="Slot Size 28" value="0x5"/>
        <value name="SLTSZ32" caption="Slot Size 32" value="0x6"/>
      </value-group>
      <value-group name="FRAMECTRL__TDMWSZ">
        <value name="WDSZ8" caption="Word Size 8" value="0x0"/>
        <value name="WDSZ12" caption="Word Size 12" value="0x1"/>
        <value name="WDSZ16" caption="Word Size 16" value="0x2"/>
        <value name="WDSZ20" caption="Word Size 20" value="0x3"/>
        <value name="WDSZ24" caption="Word Size 24" value="0x4"/>
        <value name="WDSZ28" caption="Word Size 28" value="0x5"/>
        <value name="WDSZ32" caption="Word Size 32" value="0x6"/>
      </value-group>
      <value-group name="AUDCTRL__AUDMOD">
        <value name="STDMODE" caption="I2S/I8S Standard Mode" value="0x0"/>
        <value name="LJRJMODE" caption="I2S/I8S Left Or Right Justified" value="0x1"/>
        <value name="PCMMODE" caption="PCM/DSP Mode" value="0x3"/>
      </value-group>
