Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC01/atdf/PIC32CK1025GC01100.atdf
        <register name="VREGCTRL" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="VREG Control">
          <bitfield name="VREGOUT" caption="VREG Output Control in RUN mode only. Enable by production fuse by CALSUPC.VREGOUTEN" mask="0x3" values="VREGCTRL__VREGOUT"/>
          <bitfield name="OFFSTDBY" caption="Off in Standby Control for VREGSW[N-1]. Useful for Riverside only." mask="0x4" values="VREGCTRL__OFFSTDBY"/>
          <bitfield name="LVSTDBY" caption="Low Voltage Standby Enable" mask="0x10" values="VREGCTRL__LVSTDBY"/>
          <bitfield name="LVHIB" caption="Low Voltage Hibernate Enable" mask="0x20" values="VREGCTRL__LVHIB"/>
          <bitfield name="SCAPEN" caption="Super Capacitor Charging Enable" mask="0x80"/>
          <bitfield name="CPEN" caption="Charge Pump Enable and Auto-enable." mask="0x300"/>
          <bitfield name="ULDOEN" caption="User LDO Voltage Regulator Enable" mask="0x1000"/>
          <bitfield name="ULDOSTDBY" caption="User LDO Voltage Regulator Configuration" mask="0x2000" values="VREGCTRL__ULDOSTDBY"/>
          <bitfield name="ULDOLEVEL" caption="User LDO Voltage Level Selection" mask="0xC000" values="VREGCTRL__ULDOLEVEL"/>
          <bitfield name="AVREGEN" caption="Additional Voltage Regulator Enable" mask="0x10000"/>
          <bitfield name="AVREGSTDBY" caption="Additional Voltage Regulator Configuration" mask="0x1000000" values="VREGCTRL__AVREGSTDBY"/>
        </register>
        <register name="VREFCTRL" offset="0x20" rw="RW" size="4" initval="0x00000003" caption="VREF Control">
          <bitfield name="LPSTDBY" caption="Bandgap and Regulators Low Power Standby Enable" mask="0x1" values="VREFCTRL__LPSTDBY"/>
          <bitfield name="LPHIB" caption="Bandgap and Regulators Low Power Hibernate Enable" mask="0x2" values="VREFCTRL__LPHIB"/>
          <bitfield name="TSEN" caption="Temperature Sensor Output Enable" mask="0x10"/>
        </register>
        <register name="BBPS" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Battery Backup Power Switch. This register is implemented only if SUPC_VBAT_IMPLEMENTED==1">
          <bitfield name="CONF" caption="Battery Backup Power Switch Configuration" mask="0x1" values="BBPS__CONF"/>
          <bitfield name="WKONVBATEN" caption="Wake on VBAT Enable, from Backup mode" mask="0x2"/>
          <bitfield name="WAKEEN" caption="Wake Enable" mask="0x4" values="BBPS__WAKEEN"/>
          <bitfield name="ENVBATMON" caption="Enables battery monitor" mask="0x10"/>
          <bitfield name="SELVBATMON" caption="Select VBATMON supply voltage. 0 for VDDA, and 1 for VDDBAT." mask="0x20"/>
        </register>
        <register name="BKOUT" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="Backup Output Control">
          <bitfield name="EN0" caption="Enable Output" mask="0x1"/>
          <bitfield name="EN1" caption="Enable Output" mask="0x4"/>
          <bitfield name="CLR0" caption="Clear Output" mask="0x100"/>
          <bitfield name="CLR1" caption="Clear Output" mask="0x400"/>
          <bitfield name="SET0" caption="Set Output" mask="0x10000"/>
          <bitfield name="SET1" caption="Set Output" mask="0x40000"/>
          <bitfield name="TGLOM0" caption="Toggle Output Mode" mask="0x3000000" values="BKOUT__TGLOM"/>
          <bitfield name="TGLOM1" caption="Toggle Output Mode" mask="0xC000000" values="BKOUT__TGLOM"/>
        </register>
        <register name="BKIN" offset="0x2C" rw="R" size="4" initval="0x00000000" caption="Backup Input Control">
          <bitfield name="BKIN" caption="Backup Input Value" mask="0x3"/>
        </register>
      </register-group>
      <value-group name="BOR__ACTION">
        <value name="RESET" caption="The BOR generates a reset" value="0x0"/>
        <value name="BBKUP" caption="The BOR puts the device in battery backup sleep mode" value="0x1"/>
      </value-group>
      <value-group name="BOR__DCBORPSEL">
        <value name="NODIV" caption="Not Divided" value="0x0"/>
        <value name="DIV2" caption="Divide clock by 2" value="0x1"/>
        <value name="DIV4" caption="Divide clock by 4" value="0x2"/>
        <value name="DIV8" caption="Divide clock by 8" value="0x3"/>
        <value name="DIV16" caption="Divide clock by 16" value="0x4"/>
        <value name="DIV32" caption="Divide clock by 32" value="0x5"/>
        <value name="DIV64" caption="Divide clock by 64" value="0x6"/>
        <value name="DIV128" caption="Divide clock by 128" value="0x7"/>
      </value-group>
      <value-group name="BOR__BORFILT">
        <value name="NOFILT" caption="No digital filtering" value="0x0"/>
        <value name="FILT32US" caption="32us filtering" value="0x1"/>
        <value name="FILT125US" caption="125us filtering" value="0x2"/>
        <value name="FILT250US" caption="250us filtering" value="0x3"/>
      </value-group>
      <value-group name="LVD__DIR">
        <value name="rising" caption="Rising detection" value="0x0"/>
        <value name="falling" caption="Falling detection" value="0x1"/>
      </value-group>
      <value-group name="VREGCTRL__VREGOUT">
        <value name="1p2v" caption="In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.2v." value="0x0"/>
        <value name="1p0v" caption="In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.0v." value="0x1"/>
        <value name="0p8v" caption="In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 0.8v." value="0x2"/>
      </value-group>
      <value-group name="VREGCTRL__OFFSTDBY">
        <value name="OFF" caption="In standby mode, VREGSW1,2,3 are OFF" value="0x0"/>
        <value name="ON" caption="In standby mode, VREGSW1,2,3 are ON" value="0x1"/>
      </value-group>
      <value-group name="VREGCTRL__LVSTDBY">
        <value name="1p2v" caption="In standby mode, VDDCORE_BU, VDDCORE_RAM, VDDCORE_SW and optionnaly VDDCOREUSB/PLL are set to 1.2v." value="0x0"/>
        <value name="0p8v" caption="In standby mode, VDDCORE_BU, VDDCORE_RAM, VDDCORE_SW and optionnaly VDDCOREUSB/PLL are set to 0.8v." value="0x1"/>
      </value-group>
